<a href="https://colab.research.google.com/github/FaizAlam/ML/blob/main/titanic_dataset_challenge.ipynb" target="_parent"><img src="https://colab.research.google.com/assets/colab-badge.svg" alt="Open In Colab"/></a>

In [2]:
import numpy as np
import pandas as pd
import matplotlib.pyplot as plt

In [23]:
dataset = '/content/train.csv'

In [24]:
df = pd.read_csv(dataset)
df.head()

   PassengerId  Survived  Pclass  ...     Fare Cabin  Embarked
0            1         0       3  ...   7.2500   NaN         S
1            2         1       1  ...  71.2833   C85         C
2            3         1       3  ...   7.9250   NaN         S
3            4         1       1  ...  53.1000  C123         S
4            5         0       3  ...   8.0500   NaN         S

[5 rows x 12 columns]

In [25]:
df = df.drop(['PassengerId','Pclass','Name','SibSp','Parch','Ticket','Cabin','Embarked'],axis='columns')

In [26]:
df.describe()

         Survived         Age        Fare
count  891.000000  714.000000  891.000000
mean     0.383838   29.699118   32.204208
std      0.486592   14.526497   49.693429
min      0.000000    0.420000    0.000000
25%      0.000000   20.125000    7.910400
50%      0.000000   28.000000   14.454200
75%      1.000000   38.000000   31.000000
max      1.000000   80.000000  512.329200

In [30]:
df['Age'] = df['Age'].interpolate(method="pad", limit=2)

In [ ]:
df.Age.values

In [ ]:
df.Age.astype(int)

In [ ]:
df.Age.values

In [38]:
df

     Survived     Sex   Age     Fare
0           0    male  22.0   7.2500
1           1  female  38.0  71.2833
2           1  female  26.0   7.9250
3           1  female  35.0  53.1000
4           0    male  35.0   8.0500
..        ...     ...   ...      ...
886         0    male  27.0  13.0000
887         1  female  19.0  30.0000
888         0  female  19.0  23.4500
889         1    male  26.0  30.0000
890         0    male  32.0   7.7500

[891 rows x 4 columns]

In [39]:
from sklearn.preprocessing import LabelEncoder
le_sex = LabelEncoder()

In [41]:
df['SexN']= le_sex.fit_transform(df['Sex'])

In [43]:
df = df.drop(['Sex'],axis='columns')

In [44]:
df

     Survived   Age     Fare  SexN
0           0  22.0   7.2500     1
1           1  38.0  71.2833     0
2           1  26.0   7.9250     0
3           1  35.0  53.1000     0
4           0  35.0   8.0500     1
..        ...   ...      ...   ...
886         0  27.0  13.0000     1
887         1  19.0  30.0000     0
888         0  19.0  23.4500     0
889         1  26.0  30.0000     1
890         0  32.0   7.7500     1

[891 rows x 4 columns]

In [46]:
target = df['Survived']
input = df.drop(['Survived'],axis='columns')

In [49]:
from sklearn.model_selection import train_test_split
from sklearn.naive_bayes import GaussianNB
from sklearn import tree
from sklearn.linear_model import LogisticRegression
from sklearn.svm import LinearSVC
from sklearn.ensemble import RandomForestClassifier
from sklearn.linear_model import RidgeClassifier

In [60]:
X_train, X_test, y_train, y_test = train_test_split(input,target, test_size=0.33, random_state=42)

In [61]:
#gausianNB
clf = GaussianNB()
clf.fit(X_train, y_train)
clf.score(X_test,y_test)

0.7898305084745763

In [62]:
# Decision Tree
model = tree.DecisionTreeClassifier()
model.fit(X_train,y_train)
model.score(X_test,y_test)

0.7627118644067796

In [63]:
#logistic regression
logmodel = LogisticRegression(random_state=20).fit(X_train,y_train)
logmodel.score(X_test, y_test)

0.7898305084745763

In [64]:
#Random forest
ranmodel = RandomForestClassifier(max_depth=2, random_state=0)
ranmodel.fit(X_train, y_train)
ranmodel.score(X_test,y_test)

0.7627118644067796

In [65]:
#Ridge
ridmodel = RidgeClassifier().fit(X_train, y_train)
ridmodel.score(X_test, y_test)

0.7932203389830509

Ridge Classifier has the highest score, so we will use that

In [ ]:
pred = ridmodel.predict()

Reading test csv file

In [94]:
test = pd.read_csv('/content/test.csv')

In [95]:
test = test.drop(['Pclass','Name','SibSp','Parch','Ticket','Cabin','Embarked'],axis='columns')

In [98]:
test['Age'] = test['Age'].interpolate(method="pad", limit=2)

In [ ]:
test.Age.astype(int)

In [103]:
meanFare = test.Fare.mean()

In [104]:
test.Fare = test.Fare.fillna(meanFare)

In [105]:
from sklearn.preprocessing import LabelEncoder
le_sex = LabelEncoder()
test['SexN']= le_sex.fit_transform(test['Sex'])
test = test.drop(['Sex'],axis='columns')

In [106]:
test

     PassengerId   Age      Fare  SexN
0            892  34.5    7.8292     1
1            893  47.0    7.0000     0
2            894  62.0    9.6875     1
3            895  27.0    8.6625     1
4            896  22.0   12.2875     0
..           ...   ...       ...   ...
413         1305  28.0    8.0500     1
414         1306  39.0  108.9000     0
415         1307  38.5    7.2500     1
416         1308  38.5    8.0500     1
417         1309  38.5   22.3583     1

[418 rows x 4 columns]

In [109]:
test.describe()

       PassengerId         Age        Fare        SexN
count   418.000000  418.000000  418.000000  418.000000
mean   1100.500000   30.125000   35.627188    0.636364
std     120.810458   13.905601   55.840500    0.481622
min     892.000000    0.170000    0.000000    0.000000
25%     996.250000   22.000000    7.895800    0.000000
50%    1100.500000   27.000000   14.454200    1.000000
75%    1204.750000   39.000000   31.500000    1.000000
max    1309.000000   76.000000  512.329200    1.000000

In [110]:
inp_passenger = test.PassengerId
inp_test = test.drop(['PassengerId'],axis="columns")

In [93]:
inp_test.isnull()

       Age   Fare   SexN
0    False  False  False
1    False  False  False
2    False  False  False
3    False  False  False
4    False  False  False
..     ...    ...    ...
413  False  False  False
414  False  False  False
415  False  False  False
416  False  False  False
417  False  False  False

[418 rows x 3 columns]

In [111]:
pred = ridmodel.predict(inp_test)

In [119]:
pred

     0
0    0
1    1
2    0
3    0
4    1
..  ..
413  0
414  1
415  0
416  0
417  0

[418 rows x 1 columns]

In [113]:
inp_passenger

0       892
1       893
2       894
3       895
4       896
       ...
413    1305
414    1306
415    1307
416    1308
417    1309
Name: PassengerId, Length: 418, dtype: int64

In [129]:
res = pd.DataFrame(inp_passenger)

In [131]:
res['Survived']=pred

In [127]:
res = res.set_index('PassengerId')

In [135]:
res.reset_index(drop=True, inplace=True)

In [138]:
res

     PassengerId  Survived
0            892         0
1            893         1
2            894         0
3            895         0
4            896         1
..           ...       ...
413         1305         0
414         1306         1
415         1307         0
416         1308         0
417         1309         0

[418 rows x 2 columns]

In [139]:
res.to_csv('prediction.csv',index=False)